In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [3]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [4]:
df

          W         X         Y         Z
A -1.280290 -1.889530  0.859588 -1.535155
B -1.294324 -0.220491  0.208372 -1.434780
C  1.476451  0.164762 -1.671897 -0.011721
D -1.505372  0.192156  2.806603  0.669600
E  0.528083  1.681499  2.831829 -1.555394

In [5]:
df['W']

A   -1.280290
B   -1.294324
C    1.476451
D   -1.505372
E    0.528083
Name: W, dtype: float64

In [6]:
type(df['W'])

pandas.core.series.Series

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.W

A   -1.280290
B   -1.294324
C    1.476451
D   -1.505372
E    0.528083
Name: W, dtype: float64

In [9]:
df[['W','Z']]

          W         Z
A -1.280290 -1.535155
B -1.294324 -1.434780
C  1.476451 -0.011721
D -1.505372  0.669600
E  0.528083 -1.555394

In [10]:
df['NEW']=df['W']+df['Y']

In [11]:
df

          W         X         Y         Z       NEW
A -1.280290 -1.889530  0.859588 -1.535155 -0.420702
B -1.294324 -0.220491  0.208372 -1.434780 -1.085951
C  1.476451  0.164762 -1.671897 -0.011721 -0.195446
D -1.505372  0.192156  2.806603  0.669600  1.301231
E  0.528083  1.681499  2.831829 -1.555394  3.359912

In [12]:
df.drop('NEW',axis=1)   # axis=1 means column

          W         X         Y         Z
A -1.280290 -1.889530  0.859588 -1.535155
B -1.294324 -0.220491  0.208372 -1.434780
C  1.476451  0.164762 -1.671897 -0.011721
D -1.505372  0.192156  2.806603  0.669600
E  0.528083  1.681499  2.831829 -1.555394

In [13]:
df     # still new is present

          W         X         Y         Z       NEW
A -1.280290 -1.889530  0.859588 -1.535155 -0.420702
B -1.294324 -0.220491  0.208372 -1.434780 -1.085951
C  1.476451  0.164762 -1.671897 -0.011721 -0.195446
D -1.505372  0.192156  2.806603  0.669600  1.301231
E  0.528083  1.681499  2.831829 -1.555394  3.359912

In [14]:
df.drop('NEW',axis=1,inplace=True)   #inplace=True ----->permanently deletes that column

In [15]:
df

          W         X         Y         Z
A -1.280290 -1.889530  0.859588 -1.535155
B -1.294324 -0.220491  0.208372 -1.434780
C  1.476451  0.164762 -1.671897 -0.011721
D -1.505372  0.192156  2.806603  0.669600
E  0.528083  1.681499  2.831829 -1.555394

In [16]:


df.drop('E',axis=0)   # though axis=0 is default

          W         X         Y         Z
A -1.280290 -1.889530  0.859588 -1.535155
B -1.294324 -0.220491  0.208372 -1.434780
C  1.476451  0.164762 -1.671897 -0.011721
D -1.505372  0.192156  2.806603  0.669600

In [17]:
df.shape

(5, 4)

In [18]:
df

          W         X         Y         Z
A -1.280290 -1.889530  0.859588 -1.535155
B -1.294324 -0.220491  0.208372 -1.434780
C  1.476451  0.164762 -1.671897 -0.011721
D -1.505372  0.192156  2.806603  0.669600
E  0.528083  1.681499  2.831829 -1.555394

In [19]:
df.loc['A']  # selecting Rows

W   -1.280290
X   -1.889530
Y    0.859588
Z   -1.535155
Name: A, dtype: float64

In [20]:
p=df.loc['A']

In [21]:
p

W   -1.280290
X   -1.889530
Y    0.859588
Z   -1.535155
Name: A, dtype: float64

In [22]:
type(p)

pandas.core.series.Series

In [23]:
df.iloc[2]   # row=c    it is just like loc,but loc is namewise and iloc is index wise

W    1.476451
X    0.164762
Y   -1.671897
Z   -0.011721
Name: C, dtype: float64

In [24]:
df.loc['B','Y']  # [row,col]

0.2083723721217757

In [25]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.280290  0.859588
B -1.294324  0.208372

In [26]:
df

          W         X         Y         Z
A -1.280290 -1.889530  0.859588 -1.535155
B -1.294324 -0.220491  0.208372 -1.434780
C  1.476451  0.164762 -1.671897 -0.011721
D -1.505372  0.192156  2.806603  0.669600
E  0.528083  1.681499  2.831829 -1.555394

In [27]:
df>0

       W      X      Y      Z
A  False  False   True  False
B  False  False   True  False
C   True   True  False  False
D  False   True   True   True
E   True   True   True  False

In [28]:
booldf=df>0

In [29]:
booldf

       W      X      Y      Z
A  False  False   True  False
B  False  False   True  False
C   True   True  False  False
D  False   True   True   True
E   True   True   True  False

In [30]:
df[booldf]  # true-values, false-NAN

          W         X         Y       Z
A       NaN       NaN  0.859588     NaN
B       NaN       NaN  0.208372     NaN
C  1.476451  0.164762       NaN     NaN
D       NaN  0.192156  2.806603  0.6696
E  0.528083  1.681499  2.831829     NaN

In [31]:
df[df>0]

          W         X         Y       Z
A       NaN       NaN  0.859588     NaN
B       NaN       NaN  0.208372     NaN
C  1.476451  0.164762       NaN     NaN
D       NaN  0.192156  2.806603  0.6696
E  0.528083  1.681499  2.831829     NaN

In [32]:
df['W']>0

A    False
B    False
C     True
D    False
E     True
Name: W, dtype: bool

In [33]:
df['W']

A   -1.280290
B   -1.294324
C    1.476451
D   -1.505372
E    0.528083
Name: W, dtype: float64

In [34]:
df[df['Z']<0]

          W         X         Y         Z
A -1.280290 -1.889530  0.859588 -1.535155
B -1.294324 -0.220491  0.208372 -1.434780
C  1.476451  0.164762 -1.671897 -0.011721
E  0.528083  1.681499  2.831829 -1.555394

In [17]:
df[df['W']>0]

          W         X         Y         Z
A  1.430054 -2.180526 -0.247001  1.474292
B  0.725970  0.266600 -1.697445 -0.879227
C  0.994720 -0.258658 -0.259390 -0.801704
E  0.290772  0.834684 -0.353880  0.520359

In [19]:
df[df['W']>0]['X']

A   -2.180526
B    0.266600
C   -0.258658
E    0.834684
Name: X, dtype: float64

In [21]:
df[df['W']>0][['X','Z']]

          X         Z
A -2.180526  1.474292
B  0.266600 -0.879227
C -0.258658 -0.801704
E  0.834684  0.520359

In [24]:
df[(df['W']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [25]:
df

          W         X         Y         Z
A  1.430054 -2.180526 -0.247001  1.474292
B  0.725970  0.266600 -1.697445 -0.879227
C  0.994720 -0.258658 -0.259390 -0.801704
D -0.799779  0.738332 -1.140475 -1.023623
E  0.290772  0.834684 -0.353880  0.520359

In [26]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.430054 -2.180526 -0.247001  1.474292
1     B  0.725970  0.266600 -1.697445 -0.879227
2     C  0.994720 -0.258658 -0.259390 -0.801704
3     D -0.799779  0.738332 -1.140475 -1.023623
4     E  0.290772  0.834684 -0.353880  0.520359

In [27]:
newind='CA WT FT UI OX'.split()

In [28]:
newind

['CA', 'WT', 'FT', 'UI', 'OX']

In [29]:
df['STATES']=newind

In [30]:
df

          W         X         Y         Z STATES
A  1.430054 -2.180526 -0.247001  1.474292     CA
B  0.725970  0.266600 -1.697445 -0.879227     WT
C  0.994720 -0.258658 -0.259390 -0.801704     FT
D -0.799779  0.738332 -1.140475 -1.023623     UI
E  0.290772  0.834684 -0.353880  0.520359     OX